aroyer-qc/Digini/Peripheral/inc/port/STM32F7xx/lib_class_STM32F7_fmc.h
// FMC_ECC_Page_Size FMC ECC Page Size
#define FMC_NAND_ECC_PAGE_SIZE_256BYTE                  ((uint32_t)0x00000000U)
#define FMC_NAND_ECC_PAGE_SIZE_512BYTE                  ((uint32_t)0x00020000U)
#define FMC_NAND_ECC_PAGE_SIZE_1024BYTE                 ((uint32_t)0x00040000U)
#define FMC_NAND_ECC_PAGE_SIZE_2048BYTE                 ((uint32_t)0x00060000U)
#define FMC_NAND_ECC_PAGE_SIZE_4096BYTE                 ((uint32_t)0x00080000U)
#define FMC_NAND_ECC_PAGE_SIZE_8192BYTE                 ((uint32_t)0x000A0000U)

// FMC_SDRAM_Bank FMC SDRAM Bank
#define FMC_SDRAM_BANK1                                 ((uint32_t)0x00000000U)
#define FMC_SDRAM_BANK2                                 ((uint32_t)0x00000001U)

// FMC_SDRAM_Column_Bits_number FMC SDRAM Column Bits number
#define FMC_SDRAM_COLUMN_BITS_NUM_8                     ((uint32_t)0x00000000U)
#define FMC_SDRAM_COLUMN_BITS_NUM_9                     ((uint32_t)0x00000001U)
#define FMC_SDRAM_COLUMN_BITS_NUM_10                    ((uint32_t)0x00000002U)
#define FMC_SDRAM_COLUMN_BITS_NUM_11                    ((uint32_t)0x00000003U)

// FMC_SDRAM_Row_Bits_number FMC SDRAM Row Bits number
#define FMC_SDRAM_ROW_BITS_NUM_11                       ((uint32_t)0x00000000U)
#define FMC_SDRAM_ROW_BITS_NUM_12                       ((uint32_t)0x00000004U)
#define FMC_SDRAM_ROW_BITS_NUM_13                       ((uint32_t)0x00000008U)

// FMC_SDRAM_Memory_Bus_Width FMC SDRAM Memory Bus Width
#define FMC_SDRAM_MEM_BUS_WIDTH_8                       ((uint32_t)0x00000000U)
#define FMC_SDRAM_MEM_BUS_WIDTH_16                      ((uint32_t)0x00000010U)
#define FMC_SDRAM_MEM_BUS_WIDTH_32                      ((uint32_t)0x00000020U)

// FMC_SDRAM_Internal_Banks_Number FMC SDRAM Internal Banks Number
#define FMC_SDRAM_INTERN_BANKS_NUM_2                    ((uint32_t)0x00000000U)
#define FMC_SDRAM_INTERN_BANKS_NUM_4                    ((uint32_t)0x00000040U)

// FMC_SDRAM_CAS_Latency FMC SDRAM CAS Latency
#define FMC_SDRAM_CAS_LATENCY_1                         ((uint32_t)0x00000080U)
#define FMC_SDRAM_CAS_LATENCY_2                         ((uint32_t)0x00000100U)
#define FMC_SDRAM_CAS_LATENCY_3                         ((uint32_t)0x00000180)

// FMC_SDRAM_Write_Protection FMC SDRAM Write Protection
#define FMC_SDRAM_WRITE_PROTECTION_DISABLE              ((uint32_t)0x00000000U)
#define FMC_SDRAM_WRITE_PROTECTION_ENABLE               ((uint32_t)0x00000200U)

// FMC_SDRAM_Clock_Period FMC SDRAM Clock Period
#define FMC_SDRAM_CLOCK_DISABLE                         ((uint32_t)0x00000000U)
#define FMC_SDRAM_CLOCK_PERIOD_2                        ((uint32_t)0x00000800U)
#define FMC_SDRAM_CLOCK_PERIOD_3                        ((uint32_t)0x00000C00)

// FMC_SDRAM_Read_Burst FMC SDRAM Read Burst
#define FMC_SDRAM_RBURST_DISABLE                        ((uint32_t)0x00000000U)
#define FMC_SDRAM_RBURST_ENABLE                         ((uint32_t)0x00001000U)

// FMC_SDRAM_Read_Pipe_Delay FMC SDRAM Read Pipe Delay
#define FMC_SDRAM_RPIPE_DELAY_0                         ((uint32_t)0x00000000U)
#define FMC_SDRAM_RPIPE_DELAY_1                         ((uint32_t)0x00002000U)
#define FMC_SDRAM_RPIPE_DELAY_2                         ((uint32_t)0x00004000U)

// FMC_SDRAM_Command_Mode FMC SDRAM Command Mode
#define FMC_SDRAM_CMD_NORMAL_MODE                       ((uint32_t)0x00000000U)
#define FMC_SDRAM_CMD_CLK_ENABLE                        ((uint32_t)0x00000001U)
#define FMC_SDRAM_CMD_PALL                              ((uint32_t)0x00000002U)
#define FMC_SDRAM_CMD_AUTOREFRESH_MODE                  ((uint32_t)0x00000003U)
#define FMC_SDRAM_CMD_LOAD_MODE                         ((uint32_t)0x00000004U)
#define FMC_SDRAM_CMD_SELFREFRESH_MODE                  ((uint32_t)0x00000005U)
#define FMC_SDRAM_CMD_POWERDOWN_MODE                    ((uint32_t)0x00000006U)

// FMC_SDRAM_Command_Target FMC SDRAM Command Target
#define FMC_SDRAM_CMD_TARGET_BANK2                      FMC_SDCMR_CTB2
#define FMC_SDRAM_CMD_TARGET_BANK1                      FMC_SDCMR_CTB1
#define FMC_SDRAM_CMD_TARGET_BANK1_2                    ((uint32_t)0x00000018U)

// FMC_SDRAM_Mode_Status FMC SDRAM Mode Status
#define FMC_SDRAM_NORMAL_MODE                           ((uint32_t)0x00000000U)
#define FMC_SDRAM_SELF_REFRESH_MODE                     FMC_SDSR_MODES1_0
#define FMC_SDRAM_POWER_DOWN_MODE                       FMC_SDSR_MODES1_1

// FMC_LL_Interrupt_definition FMC Low Layer Interrupt definition
#define FMC_IT_RISING_EDGE                              ((uint32_t)0x00000008U)
#define FMC_IT_LEVEL                                    ((uint32_t)0x00000010U)
#define FMC_IT_FALLING_EDGE                             ((uint32_t)0x00000020U)
#define FMC_IT_REFRESH_ERROR                            ((uint32_t)0x00004000U)

// FMC_LL_Flag_definition FMC Low Layer Flag definition
#define FMC_FLAG_RISING_EDGE                            ((uint32_t)0x00000001U)
#define FMC_FLAG_LEVEL                                  ((uint32_t)0x00000002U)
#define FMC_FLAG_FALLING_EDGE                           ((uint32_t)0x00000004U)
#define FMC_FLAG_FEMPT                                  ((uint32_t)0x00000040U)
#define FMC_SDRAM_FLAG_REFRESH_IT                       FMC_SDSR_RE
#define FMC_SDRAM_FLAG_BUSY                             FMC_SDSR_BUSY
#define FMC_SDRAM_FLAG_REFRESH_ERROR                    FMC_SDRTR_CRE



#define IS_FMC_NORSRAM_BANK(BANK)                       (((BANK) == FMC_NORSRAM_BANK1) || \
                                                         ((BANK) == FMC_NORSRAM_BANK2) || \
                                                         ((BANK) == FMC_NORSRAM_BANK3) || \
                                                         ((BANK) == FMC_NORSRAM_BANK4))

#define IS_FMC_MUX(__MUX__)                             (((__MUX__) == FMC_DATA_ADDRESS_MUX_DISABLE) || \
                                                         ((__MUX__) == FMC_DATA_ADDRESS_MUX_ENABLE))

#define IS_FMC_MEMORY(__MEMORY__)                       (((__MEMORY__) == FMC_MEMORY_TYPE_SRAM) || \
                                                         ((__MEMORY__) == FMC_MEMORY_TYPE_PSRAM)|| \
                                                         ((__MEMORY__) == FMC_MEMORY_TYPE_NOR))

#define IS_FMC_NORSRAM_MEMORY_WIDTH(__WIDTH__)          (((__WIDTH__) == FMC_NORSRAM_MEM_BUS_WIDTH_8)  || \
                                                         ((__WIDTH__) == FMC_NORSRAM_MEM_BUS_WIDTH_16) || \
                                                         ((__WIDTH__) == FMC_NORSRAM_MEM_BUS_WIDTH_32))

#define IS_FMC_ACCESS_MODE(__MODE__)                    (((__MODE__) == FMC_ACCESS_MODE_A) || \
                                                         ((__MODE__) == FMC_ACCESS_MODE_B) || \
                                                         ((__MODE__) == FMC_ACCESS_MODE_C) || \
                                                         ((__MODE__) == FMC_ACCESS_MODE_D))

