aroyer-qc/Digini/Peripheral/inc/port/STM32F7xx/lib_class_STM32F7_fmc.h
};

// FMC NORSRAM Timing parameters structure definition
struct FMC_NORSRAM_Timing_t
{
  uint32_t AddressSetupTime;             // Defines the number of HCLK cycles to configure the duration of the address setup time. This parameter can be a value between Min_Data = 0 and Max_Data = 15. @note This parameter is not used with synchronous NOR Flash memories.
  uint32_t AddressHoldTime;              // Defines the number of HCLK cycles to configure the duration of the address hold time. This parameter can be a value between Min_Data = 1 and Max_Data = 15. @note This parameter is not used with synchronous NOR Flash memories.
  uint32_t DataSetupTime;                // Defines the number of HCLK cycles to configure the duration of the data setup time. This parameter can be a value between Min_Data = 1 and Max_Data = 255.
                                         //   note This parameter is used for SRAMs, ROMs and asynchronous multiplexed NOR Flash memories.
  uint32_t BusTurnAroundDuration;        // Defines the number of HCLK cycles to configure the duration of the bus turnaround. This parameter can be a value between Min_Data = 0 and Max_Data = 15.
                                         //   note This parameter is only used for multiplexed NOR Flash memories.
  uint32_t CLKDivision;                  // Defines the period of CLK clock output signal, expressed in number of HCLK cycles. This parameter can be a value between Min_Data = 2 and Max_Data = 16.
                                         //   note This parameter is not used for asynchronous NOR Flash, SRAM or ROM accesses.
  uint32_t DataLatency;                  // Defines the number of memory clock cycles to issue to the memory before getting the first data.
                                         //    The parameter value depends on the memory type as shown below:
                                         //   - It must be set to 0 in case of a CRAM
                                         //   - It is don't care in asynchronous NOR, SRAM or ROM accesses
                                         //   - It may assume a value between Min_Data = 2 and Max_Data = 17 in NOR Flash memories with synchronous burst mode enable
  uint32_t AccessMode;                   // Specifies the asynchronous access mode. This parameter can be a value of FMC_Access_Mode
};

// FMC NAND Configuration Structure definition
struct FMC_NAND_Init_t
{
  uint32_t NandBank;            // Specifies the NAND memory device that will be used. This parameter can be a value of @ref FMC_NAND_Bank
  uint32_t Waitfeature;         // Enables or disables the Wait feature for the NAND Memory device. This parameter can be any value of @ref FMC_Wait_feature
  uint32_t MemoryDataWidth;     // Specifies the external memory device width. This parameter can be any value of @ref FMC_NAND_Data_Width
  uint32_t EccComputation;      // Enables or disables the ECC computation.This parameter can be any value of @ref FMC_ECC
  uint32_t ECCPageSize;         // Defines the page size for the extended ECC. This parameter can be any value of @ref FMC_ECC_Page_Size
  uint32_t TCLRSetupTime;       // Defines the number of HCLK cycles to configure the delay between CLE low and RE low. This parameter can be a value between Min_Data = 0 and Max_Data = 255
  uint32_t TARSetupTime;        // Defines the number of HCLK cycles to configure the delay between ALE low and RE low. This parameter can be a number between Min_Data = 0 and Max_Data = 255
};

// FMC NAND Timing parameters structure definition
struct FMC_NAND_PCC_Timing_t
{
  uint32_t SetupTime;           // Defines the number of HCLK cycles to setup address before the command assertion for NAND-Flash read or write access
                                // to common/Attribute or I/O memory space (depending on the memory space timing to be configured).
                                //  This parameter can be a value between Min_Data = 0 and Max_Data = 254
  uint32_t WaitSetupTime;       // Defines the minimum number of HCLK cycles to assert the command for NAND-Flash read or write access to
                                // common/Attribute or I/O memory space (depending on the memory space timing to be configured).
                                // This parameter can be a number between Min_Data = 0 and Max_Data = 254
  uint32_t HoldSetupTime;       // Defines the number of HCLK clock cycles to hold address (and data for write access) after the command de-assertion
                                // for NAND-Flash read or write access to common/Attribute or I/O memory space (depending on the memory space timing to be configured).
                                // This parameter can be a number between Min_Data = 0 and Max_Data = 254
  uint32_t HiZSetupTime;        // Defines the number of HCLK clock cycles during which the data bus is kept in HiZ after the start of a NAND-Flash
                                // write access to common/Attribute or I/O memory space (depending on the memory space timing to be configured).
                                // This parameter can be a number between Min_Data = 0 and Max_Data = 254
};

// FMC SDRAM Configuration Structure definition
struct FMC_SDRAM_Init_t
{
  uint32_t SDBank;              // Specifies the SDRAM memory device that will be used. This parameter can be a value of @ref FMC_SDRAM_Bank
  uint32_t ColumnBitsNumber;    // Defines the number of bits of column address. This parameter can be a value of @ref FMC_SDRAM_Column_Bits_number.
  uint32_t RowBitsNumber;       // Defines the number of bits of column address. This parameter can be a value of @ref FMC_SDRAM_Row_Bits_number.
  uint32_t MemoryDataWidth;     // Defines the memory device width. This parameter can be a value of @ref FMC_SDRAM_Memory_Bus_Width.
  uint32_t InternalBankNumber;  // Defines the number of the device's internal banks. This parameter can be of @ref FMC_SDRAM_Internal_Banks_Number.
  uint32_t CASLatency;          // Defines the SDRAM CAS latency in number of memory clock cycles. This parameter can be a value of @ref FMC_SDRAM_CAS_Latency.
  uint32_t WriteProtection;     // Enables the SDRAM device to be accessed in write mode. This parameter can be a value of @ref FMC_SDRAM_Write_Protection.
  uint32_t SDClockPeriod;       // Define the SDRAM Clock Period for both SDRAM devices and they allow to disable the clock before changing frequency. This parameter can be a value of @ref FMC_SDRAM_Clock_Period.
  uint32_t ReadBurst;           // This bit enable the SDRAM controller to anticipate the next read  commands during the CAS latency and stores data in the Read FIFO. This parameter can be a value of @ref FMC_SDRAM_Read_Burst.
  uint32_t ReadPipeDelay;       // Define the delay in system clock cycles on read data path. This parameter can be a value of @ref FMC_SDRAM_Read_Pipe_Delay.
};

// FMC SDRAM Timing parameters structure definition
struct FMC_SDRAM_Timing_t
{
  uint32_t LoadToActiveDelay;            // Defines the delay between a Load Mode Register command and an active or Refresh command in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t ExitSelfRefreshDelay;         // Defines the delay from releasing the self refresh command to issuing the Activate command in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t SelfRefreshTime;              // Defines the minimum Self Refresh period in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t RowCycleDelay;                // Defines the delay between the Refresh command and the Activate command and the delay between two consecutive Refresh commands in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t WriteRecoveryTime;            // Defines the Write recovery Time in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t RPDelay;                      // Defines the delay between a Precharge Command and an other command in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t RCDDelay;                     // Defines the delay between the Activate Command and a Read/Write command in number of memory clock cycles. This parameter can be a value between Min_Data = 1 and Max_Data = 16
};

// SDRAM command parameters structure definition
struct FMC_SDRAM_Command_t
{
  uint32_t CommandMode;                  // Defines the command issued to the SDRAM device. This parameter can be a value of @ref FMC_SDRAM_Command_Mode.
  uint32_t CommandTarget;                // Defines which device (1 or 2) the command will be issued to. This parameter can be a value of @ref FMC_SDRAM_Command_Target.
  uint32_t AutoRefreshNumber;            // Defines the number of consecutive auto refresh command issued in auto refresh mode. This parameter can be a value between Min_Data = 1 and Max_Data = 16
  uint32_t ModeRegisterDefinition;       // Defines the SDRAM Mode register content
};

//-------------------------------------------------------------------------------------------------
// Macro(s)
//-------------------------------------------------------------------------------------------------

// FMC_LL_NOR_Macros FMC NOR/SRAM Macros

/** @brief  Enable the NORSRAM device access.
  * @param  __INSTANCE__ FMC_NORSRAM Instance
  * @param  __BANK__ FMC_NORSRAM Bank
  * @retval None
  */
#define __FMC_NORSRAM_ENABLE(__INSTANCE__, __BANK__)  ((__INSTANCE__)->BTCR[(__BANK__)] |= FMC_BCR1_MBKEN)

/** @brief  Disable the NORSRAM device access.
  * @param  __INSTANCE__ FMC_NORSRAM Instance
  * @param  __BANK__ FMC_NORSRAM Bank
  * @retval None
  */
#define __FMC_NORSRAM_DISABLE(__INSTANCE__, __BANK__) ((__INSTANCE__)->BTCR[(__BANK__)] &= ~FMC_BCR1_MBKEN)

